
//======================================================
//分段注释块
//======================================================


//1.
//定义声明而未赋值的变量，默认是特殊值 undefined
var ct1;
console.log(ct1) //output => undefined

//也可以不使用var定义变量
a = 1;
//但是不使用 var 而直接 声明 x 变量且不进行赋值 // ReferenceError: x is not defined


//======================================================
// 2 变量提升机制
console.log(ct2)  
var ct2 = "韶华青春，转瞬皆逝~";

//output ：undefined
//等价于执行下面的代码，即先定义，js运行的机制是先找出全局定义的变量然后依次执行语句

var ct3;
console.log(ct3)
ct3 = "你觉得呢？"
//=======================================================